In [1]:
import pandas as pd

In [2]:
from pandas import *

In [3]:
a=pd.Series([1,2,3,4])

In [4]:
print(a)

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
a.values

array([1, 2, 3, 4], dtype=int64)

In [6]:
a.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
b=pd.Series([1,2,3,4],index=["a","b","c","d"])

In [8]:
print(b)

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
b[b>2]

c    3
d    4
dtype: int64

In [10]:
b*2

a    2
b    4
c    6
d    8
dtype: int64

In [11]:
c={"a":100,"b":200,"c":300}

In [12]:
print(c)

{'a': 100, 'b': 200, 'c': 300}

In [13]:
pd.Series(c)

a    100
b    200
c    300
dtype: int64

In [14]:
pd.isnull(c)

False

In [15]:
a=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])

In [16]:
print(a)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [17]:
pd.notnull(a)

a    True
b    True
c    True
d    True
e    True
dtype: bool

In [18]:
a.name='Population'

In [19]:
a

a    1
b    2
c    3
d    4
e    5
Name: Population, dtype: int64

In [20]:
a.index.name='Values'

In [21]:
a

Values
a    1
b    2
c    3
d    4
e    5
Name: Population, dtype: int64

In [22]:
data={'state':['Ohio','Arizona','Nevada','Wellington','Washington'],'Year':[2020,2021,2022,1991,1992],'pop':[1.2,1.1,1.4,1.1,1.2]}

In [23]:
data

{'state': ['Ohio', 'Arizona', 'Nevada', 'Wellington', 'Washington'],
 'Year': [2020, 2021, 2022, 1991, 1992],
 'pop': [1.2, 1.1, 1.4, 1.1, 1.2]}

In [24]:
c=pd.DataFrame(data)

In [25]:
c.head()

        state  Year  pop
0        Ohio  2020  1.2
1     Arizona  2021  1.1
2      Nevada  2022  1.4
3  Wellington  1991  1.1
4  Washington  1992  1.2

In [26]:
df=pd.DataFrame(data,columns=['Year','state','pop'])

In [27]:
df

   Year       state  pop
0  2020        Ohio  1.2
1  2021     Arizona  1.1
2  2022      Nevada  1.4
3  1991  Wellington  1.1
4  1992  Washington  1.2

In [28]:
df1=pd.DataFrame(data,columns=['Year','state','pop','Debt'],index=['a','b','c','d','e'])

In [29]:
df1

   Year       state  pop Debt
a  2020        Ohio  1.2  NaN
b  2021     Arizona  1.1  NaN
c  2022      Nevada  1.4  NaN
d  1991  Wellington  1.1  NaN
e  1992  Washington  1.2  NaN

In [30]:
df1.columns

Index(['Year', 'state', 'pop', 'Debt'], dtype='object')

In [31]:
df1.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [32]:
df1['state']

a          Ohio
b       Arizona
c        Nevada
d    Wellington
e    Washington
Name: state, dtype: object

In [33]:
df1

   Year       state  pop Debt
a  2020        Ohio  1.2  NaN
b  2021     Arizona  1.1  NaN
c  2022      Nevada  1.4  NaN
d  1991  Wellington  1.1  NaN
e  1992  Washington  1.2  NaN

In [34]:
df1.state

a          Ohio
b       Arizona
c        Nevada
d    Wellington
e    Washington
Name: state, dtype: object

In [35]:
df1.Year

a    2020
b    2021
c    2022
d    1991
e    1992
Name: Year, dtype: int64

In [36]:
df1.loc['c']

Year       2022
state    Nevada
pop         1.4
Debt        NaN
Name: c, dtype: object

In [37]:
df1['Debt']

a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
Name: Debt, dtype: object

In [38]:
df1.Debt

a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
Name: Debt, dtype: object

In [39]:
import numpy as np
df1['Debt']=np.arange(5)

In [40]:
df1

   Year       state  pop  Debt
a  2020        Ohio  1.2     0
b  2021     Arizona  1.1     1
c  2022      Nevada  1.4     2
d  1991  Wellington  1.1     3
e  1992  Washington  1.2     4

In [41]:
a=pd.DataFrame(range(3),index=["a","b","c"])

In [42]:
a

   0
a  0
b  1
c  2

In [43]:
a.index

Index(['a', 'b', 'c'], dtype='object')

In [44]:
a.values

array([[0],
       [1],
       [2]], dtype=int64)

In [45]:
a.index[:1]

Index(['a'], dtype='object')

In [46]:
a.index[1]

'b'

In [47]:
0 in a

True

In [48]:
a=pd.Series([1,2,3],index=['x','y','z'])

In [49]:
a

x    1
y    2
z    3
dtype: int64

In [50]:
a1=a.reindex(['a',"b",'x','y','z','c'])

In [51]:
a1

a    NaN
b    NaN
x    1.0
y    2.0
z    3.0
c    NaN
dtype: float64

In [52]:
import numpy as np


df=pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['ohio','Texas','California'])

In [53]:
df

   ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [54]:
df.reindex(['a','b','c','d'])

   ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [55]:
obj=pd.DataFrame(np.arange(5),index=['a','e','i','o','u'])

In [56]:
obj

   0
a  0
e  1
i  2
o  3
u  4

In [57]:
a=obj.drop('i')

In [58]:
a

   0
a  0
e  1
o  3
u  4

In [59]:
a=obj.drop(['i','o'])

In [60]:
a

   0
a  0
e  1
u  4

In [61]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=['a','b','c','d'],columns=["India",'US','UK','Japan'])

In [62]:
data

   India  US  UK  Japan
a      0   1   2      3
b      4   5   6      7
c      8   9  10     11
d     12  13  14     15

In [63]:
data.drop(['c'])

   India  US  UK  Japan
a      0   1   2      3
b      4   5   6      7
d     12  13  14     15

In [64]:
data.drop(['US','UK'],axis=1)

   India  Japan
a      0      3
b      4      7
c      8     11
d     12     15

In [65]:
data.T

       a  b   c   d
India  0  4   8  12
US     1  5   9  13
UK     2  6  10  14
Japan  3  7  11  15

In [66]:
obj22=pd.Series(np.arange(4),index=['a','e','i','o'])

In [67]:
obj22

a    0
e    1
i    2
o    3
dtype: int32

In [68]:
obj22['i']

2

In [69]:
obj22[2]

2

In [70]:
obj22[2:4]

i    2
o    3
dtype: int32

In [71]:
obj22[['a','e','i']]

a    0
e    1
i    2
dtype: int32

In [72]:
data=pd.DataFrame(np.arange(16).reshape(4,4),
                 index=['Ohio','Colorado','Utah','NewYork'],
                 columns=['one','two','three','four'])

In [73]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [74]:
data['two']

Ohio         1
Colorado     5
Utah         9
NewYork     13
Name: two, dtype: int32

In [75]:
data[['two','three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
NewYork    13     14

In [76]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [77]:
data[1:3]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11

In [78]:
data[data['three']>3]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [79]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
NewYork   False  False  False  False

In [81]:
ser=pd.Series(np.arange(3))

In [82]:
ser

0    0
1    1
2    2
dtype: int32

In [84]:
ser2=pd.Series(np.arange(3),index=['a','b','c'])

In [85]:
ser2

a    0
b    1
c    2
dtype: int32

In [86]:
ser[:1]

0    0
dtype: int32

In [87]:
ser.loc[:1]

0    0
1    1
dtype: int32

In [88]:
a=pd.Series([1,2,3,4],index=['a','b','c','d'])

In [90]:
b=pd.Series([1,2.2,3.3,4.4,5.5],index=['a','d','e','d','f'])

In [91]:
a

a    1
b    2
c    3
d    4
dtype: int64

In [92]:
b

a    1.0
d    2.2
e    3.3
d    4.4
f    5.5
dtype: float64

In [93]:
a+b

a    2.0
b    NaN
c    NaN
d    6.2
d    8.4
e    NaN
f    NaN
dtype: float64

In [96]:
df1=pd.DataFrame(np.arange(9).reshape(3,3),columns=list('bcd'),index=['Ohio','Texas','Colorado'])

In [97]:
df2=pd.DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [99]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [100]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [101]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [102]:
df1=pd.DataFrame({'A':[1,2]})

In [103]:
df2=pd.DataFrame({'B':[4,6]})

In [104]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

In [105]:
df1=pd.DataFrame(np.arange(12).reshape(3,4),columns=list('abcd'))

In [106]:
df2=pd.DataFrame(np.arange(20).reshape((4,5)),columns=list('abcde'))

In [107]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [108]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [112]:
data=pd.DataFrame(np.arange(12).reshape(4,3),index=['d','c','b','a'],columns=list('zyx'))

In [114]:
data

   z   y   x
d  0   1   2
c  3   4   5
b  6   7   8
a  9  10  11

In [116]:
data.sort_index()

   z   y   x
a  9  10  11
b  6   7   8
c  3   4   5
d  0   1   2

In [119]:
data.sort_index(inplace=True,axis=1)

In [120]:
data

    x   y  z
a  11  10  9
b   8   7  6
c   5   4  3
d   2   1  0

In [121]:
obj=pd.Series([-1.1,3.3,-2.3,5])

In [122]:
obj

0   -1.1
1    3.3
2   -2.3
3    5.0
dtype: float64

In [123]:
obj.sort_values()

2   -2.3
0   -1.1
1    3.3
3    5.0
dtype: float64

In [136]:
import numpy as np
s=pd.Series([-1.1,2.2,np.NaN,2,4.5,2,np.NaN])

In [137]:
s

0   -1.1
1    2.2
2    NaN
3    2.0
4    4.5
5    2.0
6    NaN
dtype: float64

In [138]:
s.sort_values()

0   -1.1
3    2.0
5    2.0
1    2.2
4    4.5
2    NaN
6    NaN
dtype: float64

In [148]:
frame=pd.DataFrame({'A':[1,2,3],'B':[4,6,1]})

In [149]:
frame

   A  B
0  1  4
1  2  6
2  3  1

In [150]:
frame.sort_values(by=['A','B'])

   A  B
0  1  4
1  2  6
2  3  1

In [152]:
frame.sort_values(by=['A','B'])

   A  B
0  1  4
1  2  6
2  3  1

In [153]:
obj=pd.Series([1,2,3,4,5],index=['a','a','b','b','c'])

In [154]:
obj

a    1
a    2
b    3
b    4
c    5
dtype: int64

In [157]:
obj.index.is_unique

False

In [158]:
obj['a']

a    1
a    2
dtype: int64

In [160]:
#Summarizing and Computing Descriptive Statistics

In [161]:
df=pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])

In [162]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [163]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [164]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [165]:
df.sum(axis='columns',skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [166]:
#Groupby

In [167]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person':['A','B','C','D','E','F'],'Sales':[200,120,340,124,243,350]}

In [168]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['A', 'B', 'C', 'D', 'E', 'F'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [169]:
df=pd.DataFrame(data)

In [170]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['A', 'B', 'C', 'D', 'E', 'F'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [171]:
df

  Company Person  Sales
0    GOOG      A    200
1    GOOG      B    120
2    MSFT      C    340
3    MSFT      D    124
4      FB      E    243
5      FB      F    350

In [174]:
print(df.groupby('Company').mean())

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [175]:
print(df.groupby('Company').median())

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [176]:
print(df.groupby('Company').sum())

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [178]:
print(df.groupby('Company').sum().loc['FB'])

Sales    593
Name: FB, dtype: int64

In [179]:
print(df.groupby('Company').count())

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [180]:
print(df.groupby('Company').max())

        Person  Sales
Company
FB           F    350
GOOG         B    200
MSFT         D    340

In [181]:
print(df.groupby('Company').describe())

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [182]:
#Joining:Joining is convinient method for combining the columns of two potentially differentially index Dataframes 
#into a single resultant frame.
left=pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B1','B2','B3','B4']}) 
right=pd.DataFrame({'C':['C0','C1','C2','C3'],'D':['D1','D2','D3','D4']})

In [183]:
left

    A   B
0  A0  B1
1  A1  B2
2  A2  B3
3  A3  B4

In [184]:
right

    C   D
0  C0  D1
1  C1  D2
2  C2  D3
3  C3  D4

In [185]:
left.join(right)

    A   B   C   D
0  A0  B1  C0  D1
1  A1  B2  C1  D2
2  A2  B3  C2  D3
3  A3  B4  C3  D4

In [187]:
left.join(right,how='outer')

    A   B   C   D
0  A0  B1  C0  D1
1  A1  B2  C1  D2
2  A2  B3  C2  D3
3  A3  B4  C3  D4